# Mission 2

In [29]:
import sqlite3 as sql

### 데모 DB 생성

In [30]:
con = sql.connect('./mission2.db')
type(con)

sqlite3.Connection

In [ ]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE productlines (
  productLine varchar(50),
  textDescription varchar(4000) DEFAULT NULL,
  htmlDescription mediumtext,
  image mediumblob,
  PRIMARY KEY (productLine)
);
'''
cursor.execute(create_cmd)

In [ ]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE products (
  productCode varchar(15),
  productName varchar(70) NOT NULL,
  productLine varchar(50) NOT NULL,
  productScale varchar(10) NOT NULL,
  productVendor varchar(50) NOT NULL,
  productDescription text NOT NULL,
  quantityInStock smallint(6) NOT NULL,
  buyPrice decimal(10,2) NOT NULL,
  MSRP decimal(10,2) NOT NULL,
  PRIMARY KEY (productCode),
  FOREIGN KEY (productLine) REFERENCES productlines (productLine)
);
'''
cursor.execute(create_cmd)

In [38]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE offices (
  officeCode varchar(10),
  city varchar(50) NOT NULL,
  phone varchar(50) NOT NULL,
  addressLine1 varchar(50) NOT NULL,
  addressLine2 varchar(50) DEFAULT NULL,
  state varchar(50) DEFAULT NULL,
  country varchar(50) NOT NULL,
  postalCode varchar(15) NOT NULL,
  territory varchar(10) NOT NULL,
  PRIMARY KEY (officeCode)
);
'''
cursor.execute(create_cmd)

In [39]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE employees (
  employeeNumber int,
  lastName varchar(50) NOT NULL,
  firstName varchar(50) NOT NULL,
  extension varchar(10) NOT NULL,
  email varchar(100) NOT NULL,
  officeCode varchar(10) NOT NULL,
  reportsTo int DEFAULT NULL,
  jobTitle varchar(50) NOT NULL,
  PRIMARY KEY (employeeNumber),
  FOREIGN KEY (reportsTo) REFERENCES employees (employeeNumber),
  FOREIGN KEY (officeCode) REFERENCES offices (officeCode)
);
'''
cursor.execute(create_cmd)

In [40]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE customers (
  customerNumber int,
  customerName varchar(50) NOT NULL,
  contactLastName varchar(50) NOT NULL,
  contactFirstName varchar(50) NOT NULL,
  phone varchar(50) NOT NULL,
  addressLine1 varchar(50) NOT NULL,
  addressLine2 varchar(50) DEFAULT NULL,
  city varchar(50) NOT NULL,
  state varchar(50) DEFAULT NULL,
  postalCode varchar(15) DEFAULT NULL,
  country varchar(50) NOT NULL,
  salesRepEmployeeNumber int DEFAULT NULL,
  creditLimit decimal(10,2) DEFAULT NULL,
  PRIMARY KEY (customerNumber),
  FOREIGN KEY (salesRepEmployeeNumber) REFERENCES employees (employeeNumber)
);
'''
cursor.execute(create_cmd)

In [47]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE orderdetails (
  orderNumber int,
  productCode varchar(15) NOT NULL,
  quantityOrdered int NOT NULL,
  priceEach decimal(10,2) NOT NULL,
  orderLineNumber smallint(6) NOT NULL,
  PRIMARY KEY (orderNumber,productCode),
  FOREIGN KEY (orderNumber) REFERENCES orders (orderNumber),
  FOREIGN KEY (productCode) REFERENCES products (productCode)
);
'''
cursor.execute(create_cmd)

In [44]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE payments (
  customerNumber int,
  checkNumber varchar(50) NOT NULL,
  paymentDate date NOT NULL,
  amount decimal(10,2) NOT NULL,
  PRIMARY KEY (customerNumber,checkNumber),
  FOREIGN KEY (customerNumber) REFERENCES customers (customerNumber)
);
'''
cursor.execute(create_cmd)

In [45]:
cursor = con.cursor()
create_cmd = '''
CREATE TABLE orders (
  orderNumber int,
  orderDate date NOT NULL,
  requiredDate date NOT NULL,
  shippedDate date DEFAULT NULL,
  status varchar(15) NOT NULL,
  comments text,
  customerNumber int NOT NULL,
  PRIMARY KEY (orderNumber),
  FOREIGN KEY (customerNumber) REFERENCES customers (customerNumber)
);
'''
cursor.execute(create_cmd)

In [ ]:
cursor = con.cursor()
cmd = """
insert  into customers(customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit) values 
(103,'Atelier graphique','Schmitt','Carine ','40.32.2555','54, rue Royale',NULL,'Nantes',NULL,'44000','France',1370,'21000.00'),(112,'Signal Gift Stores','King','Jean','7025551838','8489 Strong St.',NULL,'Las Vegas','NV','83030','USA',1166,'71800.00'),(114,'Australian Collectors, Co.','Ferguson','Peter','03 9520 4555','636 St Kilda Road','Level 3','Melbourne','Victoria','3004','Australia',1611,'117300.00'),(119,'La Rochelle Gifts','Labrune','Janine ','40.67.8555','67, rue des Cinquante Otages',NULL,'Nantes',NULL,'44000','France',1370,'118200.00'),(121,'Baane Mini Imports','Bergulfsen','Jonas ','07-98 9555','Erling Skakkes gate 78',NULL,'Stavern',NULL,'4110','Norway',1504,'81700.00'),(124,'Mini Gifts Distributors Ltd.','Nelson','Susan','4155551450','5677 Strong St.',NULL,'San Rafael','CA','97562','USA',1165,'210500.00'),(125,'Havel & Zbyszek Co','Piestrzeniewicz','Zbyszek ','(26) 642-7555','ul. Filtrowa 68',NULL,'Warszawa',NULL,'01-012','Poland',NULL,'0.00'),(128,'Blauer See Auto, Co.','Keitel','Roland','+49 69 66 90 2555','Lyonerstr. 34',NULL,'Frankfurt',NULL,'60528','Germany',1504,'59700.00'),(129,'Mini Wheels Co.','Murphy','Julie','6505555787','5557 North Pendale Street',NULL,'San Francisco','CA','94217','USA',1165,'64600.00'),(131,'Land of Toys Inc.','Lee','Kwai','2125557818','897 Long Airport Avenue',NULL,'NYC','NY','10022','USA',1323,'114900.00'),(141,'Euro+ Shopping Channel','Freyre','Diego ','(91) 555 94 44','C/ Moralzarzal, 86',NULL,'Madrid',NULL,'28034','Spain',1370,'227600.00'),(144,'Volvo Model Replicas, Co','Berglund','Christina ','0921-12 3555','Berguvsvägen  8',NULL,'Luleå',NULL,'S-958 22','Sweden',1504,'53100.00'),(145,'Danish Wholesale Imports','Petersen','Jytte ','31 12 3555','Vinbæltet 34',NULL,'Kobenhavn',NULL,'1734','Denmark',1401,'83400.00'),(146,'Saveley & Henriot, Co.','Saveley','Mary ','78.32.5555','2, rue du Commerce',NULL,'Lyon',NULL,'69004','France',1337,'123900.00'),(148,'Dragon Souveniers, Ltd.','Natividad','Eric','+65 221 7555','Bronz Sok.','Bronz Apt. 3/6 Tesvikiye','Singapore',NULL,'079903','Singapore',1621,'103800.00'),(151,'Muscle Machine Inc','Young','Jeff','2125557413','4092 Furth Circle','Suite 400','NYC','NY','10022','USA',1286,'138500.00'),(157,'Diecast Classics Inc.','Leong','Kelvin','2155551555','7586 Pompton St.',NULL,'Allentown','PA','70267','USA',1216,'100600.00'),(161,'Technics Stores Inc.','Hashimoto','Juri','6505556809','9408 Furth Circle',NULL,'Burlingame','CA','94217','USA',1165,'84600.00'),(166,'Handji Gifts& Co','Victorino','Wendy','+65 224 1555','106 Linden Road Sandown','2nd Floor','Singapore',NULL,'069045','Singapore',1612,'97900.00'),(167,'Herkku Gifts','Oeztan','Veysel','+47 2267 3215','Brehmen St. 121','PR 334 Sentrum','Bergen',NULL,'N 5804','Norway  ',1504,'96800.00'),(168,'American Souvenirs Inc','Franco','Keith','2035557845','149 Spinnaker Dr.','Suite 101','New Haven','CT','97823','USA',1286,'0.00'),(169,'Porto Imports Co.','de Castro','Isabel ','(1) 356-5555','Estrada da saúde n. 58',NULL,'Lisboa',NULL,'1756','Portugal',NULL,'0.00'),(171,'Daedalus Designs Imports','Rancé','Martine ','20.16.1555','184, chaussée de Tournai',NULL,'Lille',NULL,'59000','France',1370,'82900.00');
"""
cursor.execute(cmd)

## SQL 튜토리얼

### SQL SELECT Statement

In [65]:
cursor = con.cursor()
cmd = """
SELECT customerName, city FROM Customers;
"""
cursor.execute(cmd)
print(cursor.fetchone())
print(cursor.fetchmany(3))

('Atelier graphique', 'Nantes')
[('Signal Gift Stores', 'Las Vegas'), ('Australian Collectors, Co.', 'Melbourne'), ('La Rochelle Gifts', 'Nantes')]

In [62]:
cursor = con.cursor()
cmd = """
SELECT * FROM Customers;
"""
cursor.execute(cmd)
cursor.fetchone()

(103,
 'Atelier graphique',
 'Schmitt',
 'Carine ',
 '40.32.2555',
 '54, rue Royale',
 None,
 'Nantes',
 None,
 '44000',
 'France',
 1370,
 21000)

### SQL SELECT DISTINCT Statement

In [66]:
# 다른값만 반환
cursor = con.cursor()
cmd = """
SELECT DISTINCT country FROM Customers;
"""
cursor.execute(cmd)
cursor.fetchall()

[('France',),
 ('USA',),
 ('Australia',),
 ('Norway',),
 ('Poland',),
 ('Germany',),
 ('Spain',),
 ('Sweden',),
 ('Denmark',),
 ('Singapore',),
 ('Norway  ',),
 ('Portugal',)]

### SELECT Example Without DISTINCT

In [67]:
cursor = con.cursor()
cmd = """
SELECT country FROM Customers;
"""
cursor.execute(cmd)
cursor.fetchall()

[('France',),
 ('USA',),
 ('Australia',),
 ('France',),
 ('Norway',),
 ('USA',),
 ('Poland',),
 ('Germany',),
 ('USA',),
 ('USA',),
 ('Spain',),
 ('Sweden',),
 ('Denmark',),
 ('France',),
 ('Singapore',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('Singapore',),
 ('Norway  ',),
 ('USA',),
 ('Portugal',),
 ('France',)]

### Count Distinct

In [68]:
cursor = con.cursor()
cmd = """
SELECT COUNT(DISTINCT country) FROM Customers;
"""
cursor.execute(cmd)
cursor.fetchall()

[(12,)]

### SQL WHERE Clause

In [72]:
cursor = con.cursor()
cmd = """
SELECT * FROM Customers
WHERE country='France';
"""
cursor.execute(cmd)
cursor.fetchall()

[(103,
  'Atelier graphique',
  'Schmitt',
  'Carine ',
  '40.32.2555',
  '54, rue Royale',
  None,
  'Nantes',
  None,
  '44000',
  'France',
  1370,
  21000),
 (119,
  'La Rochelle Gifts',
  'Labrune',
  'Janine ',
  '40.67.8555',
  '67, rue des Cinquante Otages',
  None,
  'Nantes',
  None,
  '44000',
  'France',
  1370,
  118200),
 (146,
  'Saveley & Henriot, Co.',
  'Saveley',
  'Mary ',
  '78.32.5555',
  '2, rue du Commerce',
  None,
  'Lyon',
  None,
  '69004',
  'France',
  1337,
  123900),
 (171,
  'Daedalus Designs Imports',
  'Rancé',
  'Martine ',
  '20.16.1555',
  '184, chaussée de Tournai',
  None,
  'Lille',
  None,
  '59000',
  'France',
  1370,
  82900)]

### Operators in The WHERE Clause

In [74]:
cursor = con.cursor()
cmd = """
SELECT * FROM Customers
WHERE creditLimit > 100000;
"""
cursor.execute(cmd)
cursor.fetchall()

[(114,
  'Australian Collectors, Co.',
  'Ferguson',
  'Peter',
  '03 9520 4555',
  '636 St Kilda Road',
  'Level 3',
  'Melbourne',
  'Victoria',
  '3004',
  'Australia',
  1611,
  117300),
 (119,
  'La Rochelle Gifts',
  'Labrune',
  'Janine ',
  '40.67.8555',
  '67, rue des Cinquante Otages',
  None,
  'Nantes',
  None,
  '44000',
  'France',
  1370,
  118200),
 (124,
  'Mini Gifts Distributors Ltd.',
  'Nelson',
  'Susan',
  '4155551450',
  '5677 Strong St.',
  None,
  'San Rafael',
  'CA',
  '97562',
  'USA',
  1165,
  210500),
 (131,
  'Land of Toys Inc.',
  'Lee',
  'Kwai',
  '2125557818',
  '897 Long Airport Avenue',
  None,
  'NYC',
  'NY',
  '10022',
  'USA',
  1323,
  114900),
 (141,
  'Euro+ Shopping Channel',
  'Freyre',
  'Diego ',
  '(91) 555 94 44',
  'C/ Moralzarzal, 86',
  None,
  'Madrid',
  None,
  '28034',
  'Spain',
  1370,
  227600),
 (146,
  'Saveley & Henriot, Co.',
  'Saveley',
  'Mary ',
  '78.32.5555',
  '2, rue du Commerce',
  None,
  'Lyon',
  None,
  '69004',
  'France',
  1337,
  123900),
 (148,
  'Dragon Souveniers, Ltd.',
  'Natividad',
  'Eric',
  '+65 221 7555',
  'Bronz Sok.',
  'Bronz Apt. 3/6 Tesvikiye',
  'Singapore',
  None,
  '079903',
  'Singapore',
  1621,
  103800),
 (151,
  'Muscle Machine Inc',
  'Young',
  'Jeff',
  '2125557413',
  '4092 Furth Circle',
  'Suite 400',
  'NYC',
  'NY',
  '10022',
  'USA',
  1286,
  138500),
 (157,
  'Diecast Classics Inc.',
  'Leong',
  'Kelvin',
  '2155551555',
  '7586 Pompton St.',
  None,
  'Allentown',
  'PA',
  '70267',
  'USA',
  1216,
  100600)]

### SQL ORDER BY Keyword

In [80]:
cursor = con.cursor()
cmd = """
SELECT salesRepEmployeeNumber FROM Customers
ORDER BY salesRepEmployeeNumber DESC;
"""
cursor.execute(cmd)
cursor.fetchall()

[(1621,),
 (1612,),
 (1611,),
 (1504,),
 (1504,),
 (1504,),
 (1504,),
 (1401,),
 (1370,),
 (1370,),
 (1370,),
 (1370,),
 (1337,),
 (1323,),
 (1286,),
 (1286,),
 (1216,),
 (1166,),
 (1165,),
 (1165,),
 (1165,),
 (None,),
 (None,)]

In [79]:
cursor = con.cursor()
cmd = """
SELECT customerName FROM Customers
ORDER BY customerName;
"""
cursor.execute(cmd)
cursor.fetchall()

[('American Souvenirs Inc',),
 ('Atelier graphique',),
 ('Australian Collectors, Co.',),
 ('Baane Mini Imports',),
 ('Blauer See Auto, Co.',),
 ('Daedalus Designs Imports',),
 ('Danish Wholesale Imports',),
 ('Diecast Classics Inc.',),
 ('Dragon Souveniers, Ltd.',),
 ('Euro+ Shopping Channel',),
 ('Handji Gifts& Co',),
 ('Havel & Zbyszek Co',),
 ('Herkku Gifts',),
 ('La Rochelle Gifts',),
 ('Land of Toys Inc.',),
 ('Mini Gifts Distributors Ltd.',),
 ('Mini Wheels Co.',),
 ('Muscle Machine Inc',),
 ('Porto Imports Co.',),
 ('Saveley & Henriot, Co.',),
 ('Signal Gift Stores',),
 ('Technics Stores Inc.',),
 ('Volvo Model Replicas, Co',)]

In [81]:
cursor = con.cursor()
cmd = """
SELECT country, customerName FROM Customers
ORDER BY country ASC, customerName DESC;
"""
cursor.execute(cmd)
cursor.fetchall()

[('Australia', 'Australian Collectors, Co.'),
 ('Denmark', 'Danish Wholesale Imports'),
 ('France', 'Saveley & Henriot, Co.'),
 ('France', 'La Rochelle Gifts'),
 ('France', 'Daedalus Designs Imports'),
 ('France', 'Atelier graphique'),
 ('Germany', 'Blauer See Auto, Co.'),
 ('Norway', 'Baane Mini Imports'),
 ('Norway  ', 'Herkku Gifts'),
 ('Poland', 'Havel & Zbyszek Co'),
 ('Portugal', 'Porto Imports Co.'),
 ('Singapore', 'Handji Gifts& Co'),
 ('Singapore', 'Dragon Souveniers, Ltd.'),
 ('Spain', 'Euro+ Shopping Channel'),
 ('Sweden', 'Volvo Model Replicas, Co'),
 ('USA', 'Technics Stores Inc.'),
 ('USA', 'Signal Gift Stores'),
 ('USA', 'Muscle Machine Inc'),
 ('USA', 'Mini Wheels Co.'),
 ('USA', 'Mini Gifts Distributors Ltd.'),
 ('USA', 'Land of Toys Inc.'),
 ('USA', 'Diecast Classics Inc.'),
 ('USA', 'American Souvenirs Inc')]

### SQL AND Operator

In [83]:
cursor = con.cursor()
cmd = """
SELECT customerName, country
FROM Customers
WHERE country = 'USA' AND customerName LIKE 'M%'
"""
cursor.execute(cmd)
cursor.fetchall()

[('Mini Gifts Distributors Ltd.', 'USA'),
 ('Mini Wheels Co.', 'USA'),
 ('Muscle Machine Inc', 'USA')]

### Combining AND and OR

In [86]:
cursor = con.cursor()
cmd = """
SELECT customerName, country
FROM Customers
WHERE country = 'USA' 
AND (customerName LIKE 'M%' OR customerName LIKE 'A%');
"""
cursor.execute(cmd)
cursor.fetchall()

[('Mini Gifts Distributors Ltd.', 'USA'),
 ('Mini Wheels Co.', 'USA'),
 ('Muscle Machine Inc', 'USA'),
 ('American Souvenirs Inc', 'USA')]

In [87]:
cursor = con.cursor()
cmd = """
SELECT customerName, country
FROM Customers
WHERE country = 'USA' 
AND customerName LIKE 'M%' 
OR customerName LIKE 'A%';
"""
cursor.execute(cmd)
cursor.fetchall()

[('Atelier graphique', 'France'),
 ('Australian Collectors, Co.', 'Australia'),
 ('Mini Gifts Distributors Ltd.', 'USA'),
 ('Mini Wheels Co.', 'USA'),
 ('Muscle Machine Inc', 'USA'),
 ('American Souvenirs Inc', 'USA')]

### SQL OR Operator

In [88]:
cursor = con.cursor()
cmd = """
SELECT customerName, country
FROM Customers
WHERE country = 'USA' 
OR country = 'France'
"""
cursor.execute(cmd)
cursor.fetchall()

[('Atelier graphique', 'France'),
 ('Signal Gift Stores', 'USA'),
 ('La Rochelle Gifts', 'France'),
 ('Mini Gifts Distributors Ltd.', 'USA'),
 ('Mini Wheels Co.', 'USA'),
 ('Land of Toys Inc.', 'USA'),
 ('Saveley & Henriot, Co.', 'France'),
 ('Muscle Machine Inc', 'USA'),
 ('Diecast Classics Inc.', 'USA'),
 ('Technics Stores Inc.', 'USA'),
 ('American Souvenirs Inc', 'USA'),
 ('Daedalus Designs Imports', 'France')]

### SQL Not

In [89]:
cursor = con.cursor()
cmd = """
SELECT customerName, country
FROM Customers
WHERE NOT country = 'USA';
"""
cursor.execute(cmd)
cursor.fetchall()

[('Atelier graphique', 'France'),
 ('Australian Collectors, Co.', 'Australia'),
 ('La Rochelle Gifts', 'France'),
 ('Baane Mini Imports', 'Norway'),
 ('Havel & Zbyszek Co', 'Poland'),
 ('Blauer See Auto, Co.', 'Germany'),
 ('Euro+ Shopping Channel', 'Spain'),
 ('Volvo Model Replicas, Co', 'Sweden'),
 ('Danish Wholesale Imports', 'Denmark'),
 ('Saveley & Henriot, Co.', 'France'),
 ('Dragon Souveniers, Ltd.', 'Singapore'),
 ('Handji Gifts& Co', 'Singapore'),
 ('Herkku Gifts', 'Norway  '),
 ('Porto Imports Co.', 'Portugal'),
 ('Daedalus Designs Imports', 'France')]

In [93]:
cursor = con.cursor()
cmd = """
SELECT customerName, country
FROM Customers
WHERE customerName NOT LIKE 'M%';
"""
cursor.execute(cmd)
cursor.fetchall()

[('Atelier graphique', 'France'),
 ('Signal Gift Stores', 'USA'),
 ('Australian Collectors, Co.', 'Australia'),
 ('La Rochelle Gifts', 'France'),
 ('Baane Mini Imports', 'Norway'),
 ('Havel & Zbyszek Co', 'Poland'),
 ('Blauer See Auto, Co.', 'Germany'),
 ('Land of Toys Inc.', 'USA'),
 ('Euro+ Shopping Channel', 'Spain'),
 ('Volvo Model Replicas, Co', 'Sweden'),
 ('Danish Wholesale Imports', 'Denmark'),
 ('Saveley & Henriot, Co.', 'France'),
 ('Dragon Souveniers, Ltd.', 'Singapore'),
 ('Diecast Classics Inc.', 'USA'),
 ('Technics Stores Inc.', 'USA'),
 ('Handji Gifts& Co', 'Singapore'),
 ('Herkku Gifts', 'Norway  '),
 ('American Souvenirs Inc', 'USA'),
 ('Porto Imports Co.', 'Portugal'),
 ('Daedalus Designs Imports', 'France')]

In [95]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, country
FROM Customers
WHERE customerNumber NOT BETWEEN 120 AND 160;
"""
cursor.execute(cmd)
cursor.fetchall()

[(103, 'France'),
 (112, 'USA'),
 (114, 'Australia'),
 (119, 'France'),
 (161, 'USA'),
 (166, 'Singapore'),
 (167, 'Norway  '),
 (168, 'USA'),
 (169, 'Portugal'),
 (171, 'France')]

In [96]:
cursor = con.cursor()
cmd = """
SELECT country, customerName
FROM Customers
WHERE country NOT IN ('France', 'USA');
"""
cursor.execute(cmd)
cursor.fetchall()

[('Australia', 'Australian Collectors, Co.'),
 ('Norway', 'Baane Mini Imports'),
 ('Poland', 'Havel & Zbyszek Co'),
 ('Germany', 'Blauer See Auto, Co.'),
 ('Spain', 'Euro+ Shopping Channel'),
 ('Sweden', 'Volvo Model Replicas, Co'),
 ('Denmark', 'Danish Wholesale Imports'),
 ('Singapore', 'Dragon Souveniers, Ltd.'),
 ('Singapore', 'Handji Gifts& Co'),
 ('Norway  ', 'Herkku Gifts'),
 ('Portugal', 'Porto Imports Co.')]

In [97]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, country
FROM Customers
WHERE customerNumber > 160;
"""
cursor.execute(cmd)
cursor.fetchall()

[(161, 'USA'),
 (166, 'Singapore'),
 (167, 'Norway  '),
 (168, 'USA'),
 (169, 'Portugal'),
 (171, 'France')]

### SQL Insert Into
데모 데이터 생성 시 구현

### SQL Null Values

In [98]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, country, state
FROM Customers
WHERE state IS NULL;
"""
cursor.execute(cmd)
cursor.fetchall()

[(103, 'France', None),
 (119, 'France', None),
 (121, 'Norway', None),
 (125, 'Poland', None),
 (128, 'Germany', None),
 (141, 'Spain', None),
 (144, 'Sweden', None),
 (145, 'Denmark', None),
 (146, 'France', None),
 (148, 'Singapore', None),
 (166, 'Singapore', None),
 (167, 'Norway  ', None),
 (169, 'Portugal', None),
 (171, 'France', None)]

In [99]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, country, state
FROM Customers
WHERE state IS NOT NULL;
"""
cursor.execute(cmd)
cursor.fetchall()

[(112, 'USA', 'NV'),
 (114, 'Australia', 'Victoria'),
 (124, 'USA', 'CA'),
 (129, 'USA', 'CA'),
 (131, 'USA', 'NY'),
 (151, 'USA', 'NY'),
 (157, 'USA', 'PA'),
 (161, 'USA', 'CA'),
 (168, 'USA', 'CT')]

### SQL Update

In [101]:
cursor = con.cursor()
cmd = """
UPDATE Customers
SET customerName = 'Sumin', contactLastName = 'Joo'
WHERE customerNumber = 103;
"""
cursor.execute(cmd)
con.commit()

In [109]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, customerName, contactLastName
FROM Customers
WHERE customerNumber = 103;
"""
cursor.execute(cmd)
cursor.fetchall()

[(103, 'Sumin', 'Joo')]

### SQL Delete

In [105]:
cursor = con.cursor()
cmd = """
DELETE FROM customers
WHERE customerNumber = 112;
"""
cursor.execute(cmd)
con.commit()

In [ ]:
con.close()
con = sql.connect('./mission2.db')
cursor = con.cursor()
cmd = """
DROP TABLE products;
"""
cursor.execute(cmd)

### SQL Select Top

In [118]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, customerName, contactLastName
FROM Customers
LIMIT 3;
"""
cursor.execute(cmd)
cursor.fetchall()

[(103, 'Sumin', 'Joo'),
 (114, 'Australian Collectors, Co.', 'Ferguson'),
 (119, 'La Rochelle Gifts', 'Labrune')]

In [126]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, customerName, country
FROM Customers
WHERE country = 'USA'
LIMIT 3;
"""
cursor.execute(cmd)
cursor.fetchall()

[(124, 'Mini Gifts Distributors Ltd.', 'USA'),
 (129, 'Mini Wheels Co.', 'USA'),
 (131, 'Land of Toys Inc.', 'USA')]

In [130]:
cursor = con.cursor()
cmd = """
SELECT customerNumber, customerName, country
FROM Customers
WHERE country = 'USA'
ORDER BY customerName DESC
LIMIT 3;
"""
cursor.execute(cmd)
cursor.fetchall()

[(161, 'Technics Stores Inc.', 'USA'),
 (151, 'Muscle Machine Inc', 'USA'),
 (129, 'Mini Wheels Co.', 'USA')]

### SQL Aggregate Functions

### SQL Min and Max

In [131]:
cursor = con.cursor()
cmd = """
SELECT MAX(creditLimit)
FROM Customers;
"""
cursor.execute(cmd)
cursor.fetchall()

[(227600,)]

In [140]:
cursor = con.cursor()
cmd = """
SELECT country, MAX(creditLimit) AS maxLimit, customerNumber
FROM Customers
GROUP BY country;
"""
cursor.execute(cmd)
cursor.fetchall()

[('Australia', 117300, 114),
 ('Denmark', 83400, 145),
 ('France', 123900, 146),
 ('Germany', 59700, 128),
 ('Norway', 81700, 121),
 ('Norway  ', 96800, 167),
 ('Poland', 0, 125),
 ('Portugal', 0, 169),
 ('Singapore', 103800, 148),
 ('Spain', 227600, 141),
 ('Sweden', 53100, 144),
 ('USA', 210500, 124)]

### SQL Count

In [147]:
cursor = con.cursor()
cmd = """
SELECT count(country)
FROM Customers;
"""
cursor.execute(cmd)
cursor.fetchall()

[(22,)]

In [146]:
cursor = con.cursor()
cmd = """
SELECT count(DISTINCT country)
FROM Customers;
"""
cursor.execute(cmd)
cursor.fetchall()

[(12,)]

In [152]:
cursor = con.cursor()
cmd = """
SELECT country, COUNT(*) AS [Number of records]
FROM Customers
GROUP BY country
"""
cursor.execute(cmd)
cursor.fetchall()

[('Australia', 1),
 ('Denmark', 1),
 ('France', 4),
 ('Germany', 1),
 ('Norway', 1),
 ('Norway  ', 1),
 ('Poland', 1),
 ('Portugal', 1),
 ('Singapore', 2),
 ('Spain', 1),
 ('Sweden', 1),
 ('USA', 7)]

### SQL Sum

### SQL Avg

### SQL Like

### SQL WildCards

### SQL In

### SQL Between

### SQL Aliases

### SQL Joins

### SQL Inner Join

### SQL Left Join

### SQL Right Join

### SQL Full Join

### SQL Union

### SQL Group By

### SQL Having

### SQL Exists

### SQL Any, All

### SQL Select Into

### SQL Insert Into Select

### SQL Case

### SQL Null Functions

### SQL Stored Procedures

### SQL Comments

### SQL Operators